Repository: eubr-bigsea/limonero
Catalog: limonero/i18n/locales/*/LC_MESSAGES/messages.po
Languages: pt

source: Validation error
pt: Erro de validação

source: Internal error
pt: Erro interno

source: Running in %(mode)s mode
pt: Executando no modo %(mode)s

source: Please, set LIMONERO_CONFIG environment variable
pt: Por favor, defina a variável de ambiente LIMONERO_CONFIG

source: Limonero HDFS access not correctly configured (see config 'dfs.client.use.datanode.hostname')
pt: Acesso ao HDFS pelo Limonero não está configurado corretamente (veja a opção de configuração 'dfs.client.use.datanode.hostname')

source: At least one value for attribute '{attr}' is incompatible with the type '{type}': {v}
pt: Pelo menos um valor para o atributo '{attr}' é incompatível com o tipo '{type}': {v}

source: Missing json in the request body
pt: JSON ausente no corpo da requisição

source: Invalid data
pt: Dados inválidos

source: %(type)s not found.
pt: %(type)s não foi encontrado(a).

source: Data source
pt: Fonte de dados

source: You are not authorized to perform this action
pt: Você não tem permissão para realizar esta ação

source: %(what)s was successfuly deleted
pt: %(what)s foi excluído(a) com sucesso

source: Insufficient data
pt: Dados insuficientes

source: Lookup tables can only have 2 attributes (id and description)
pt: Tabelas de referência (lookup) podem ter apenas 2 atributos (id and description)

source: %(what)s was successfuly updated
pt: %(what)s foi atualizado(a) com sucesso

source: Missing required parameters
pt: Parâmetros obrigatórios ausentes

source: Not found
pt: Não encontrado

source: A file with same name already exists. Try to upload the file again.
pt: Um arquivo com o mesmo nome já existe. Tente enviar o arquivo novamente com um novo nome.

source: Imported in Limonero
pt: Importado pelo Limonero

source: Missing token
pt: Marcador (token) de controle ausente.

source: Invalid or expired token. Refresh the listing page.
pt: Marcador (token) de controle inválido ou expirado. Atualize a página de listagem.

source: Invalid data source.
pt: Fonte de dados inválida.

source: Data source does not have a command specified
pt: Fonte de dados não tem um comando especificado para ela

source: Could not connect to database
pt: Não foi possível conectar à base de dados

source: Unsupported database: %(what)s
pt: Serviço de banco de dados não suportado: %(what)s

source: Unsupported filesystem: {fs}
pt: Sistema de arquivos não suportado: {fs}

source: Unsupported filesystem:
pt: Sistema de arquivos não suportado:

source: Cannot infer the schema: %(what)s
pt: Não é possível inferir o esquema: %(what)s

source: Unsupported
pt: Não suportado

source: Cannot infer the schema for shapefile (invalid Zip file content).
pt: Não é possível inferir o esquema para arquivos shapefile (conteúdo inválido para o arquivo ZIP)

source: Cannot infer the schema for format %(format)s
pt: Não é possível inferir o esquema da fonte de dados para o formato %(format)s

source: Invalid CSV encoding
pt: Codificação inválida para arquivo CSV

source: Internal error, try later
pt: Erro interno, tente mais tarde

source: row
pt: linha

source: <Invalid data>: `{}`
pt: <Dados inválidos>: `{}`

source: Data type are not correctly defined. Please, revise them.
pt: Tipos de dado não estão corretamente definidos. Por favor, revise-os.

source: Unsupported Parquet data type: {t}
pt: Tipo de dado não suportado pelo Parquet: {t}

source: Model
pt: Modelo

source: Insufficient data.
pt: Dados insuficientes.

source: Updating %s (id=%s)
pt: Atualizando %s (id=%s)

source: %(n)s (id=%(id)s) was updated with success!
pt: %(n)s (id=%(id)s) foi salvo(a) com sucesso

source: %(what)s saved with success
pt: %(what)s foi salvo(a) com sucesso

source: Error deleting %(what)s.
pt: Erro ao tentar excluir %(what)s.

source: Storage
pt: Armazenamento

source: Listing %(name)s
pt: Listando %(name)s

source: Adding %s
pt: Adicionando %s

source: Retrieving %s (id=%s)
pt: Recuperando %s (id=%s)

source: %(name)s not found (id=%(id)s)
pt: %(name)s não foi encontrado(a) (id=%(id)s)

source: Deleting %s (id=%s)
pt: Excluindo %s (id=%s)

source: %(name)s deleted with success!
pt: %(name)s foi apagado(a) com sucesso

source: Missing data for required field.
pt: Dados obrigatórios ausentes.

source: File already exists
pt: Arquivo já existe

source: Not all variables were expanded. Please, check informed values: {}
pt: Nem todas as variáveis foram expandidas. Por favor, verifique os valores informados: {}
